cases/Reactive_Transport/dissolution/2D porous media/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


transportModel  Newtonian;

muf         muf     	 [1 -1 -1 0 0 0 0 ] 2.4e-4;
r            r           [0 1 -1 0 0 0 0] 5e-2;
rhos        rhos         [1 -3 0 0 0 0 0] 2710;
rhof        rhof         [1 -3 0 0 0 0 0] 920;
Da           Da            [0 2 -1 0 0 0 0]  5e-6;

beta         beta          [0 0 0 0 0 0 0]  1.37;
//alphabeta0         alphabeta0          [0 0 -1 0 0 0 0]  100;
a           a            [0 0 1 0 0 0 0]  1;


// ************************************************************************* //
