cases/Reactive_Transport/dissolution/2D porous media/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration    | Version:  7                                     |
|   \\  /    A nd          | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}

// The field to set
fields
(
    eps
    mineral
    C
);

// Method of setting the field
setFormat raw;

// Set the STL file as the region to apply the field
regions
(   
    boxToCell
    {
        box (-1.25 -0.625 0) (1.25 0.625 0.01);
        fieldValues
        (
           volScalarFieldValue eps 0.0001
           volScalarFieldValue mineral 1
           volScalarFieldValue C 1e-7
        );
    }
/*
	surfaceToCell
    {
        file "constant/triSurface/hetero.stl";
        outsidePoints // definition of outside
        (
            (0 0 0)
        ); 
        includeCut false; // cells cut by surface
        includeInside yes; // cells not on outside of surf
        includeOutside no; // cells on outside of surf
        nearDistance -1; // cells with centre near surf
        curvature 0.9; // cells within nearDistance
        fieldValues
        (
            volScalarFieldValue eps 1
			//volScalarFieldValue C  0.6
			//volScalarFieldValue mineral  0
        );
    }
*/
	surfaceToCell
    {
        file "constant/triSurface/mineral.stl";
        outsidePoints // definition of outside
        (
            (-0.00036 0 0)
        ); 
        includeCut false; // cells cut by surface
        includeInside no; // cells not on outside of surf
        includeOutside yes; // cells on outside of surf
        nearDistance -1; // cells with centre near surf
        curvature 0.9; // cells within nearDistance
        fieldValues
        (
            volScalarFieldValue eps 1
			volScalarFieldValue mineral  0.0001
			//volScalarFieldValue C  1e-2
        );
    }

);

// Default value for points not inside the set region
defaultValue uniform (0 0 0);

// Method of interpolating values for points not inside the set region
interpolationScheme cell;

// Write output to time directories
writeControl timeStep;



// ************************************************************************* //
